"""
Живчин Роман, КНМС-11, 1 підгрупа;
індивідуальне завдання, експертна система - онлайн тренер по темі спорту, плану тренувань, дієти і тд...
"""

questions = {
    "general": [
        "Ваша ціль набрати м'язову масу? (Так/Ні):\n",
        "Ваша ціль скинути вагу? (Так/Ні):\n",
        "Ваша ціль пітримати вашу вагу? (Так/Ні):\n",
        "Ваша ціль збільшити силу або витривалість? (Так/Ні):\n"
    ],

    "gain muscle": [
        "Чи швидко ви набираєте вагу? (Так/Ні):\n",
        "Ви ведете активний спосіб життя? (Так/Ні):\n"
    ],

    "lose fat": [
        "Чи швидко ви набираєте вагу? (Так/Ні):\n",
        "Ви ведете активний спосіб життя? (Так/Ні):\n"
    ],

    "maintain weight": [
        "Чи високий у вас рівень стресу на протязі дня? (Так/Ні):\n"
    ],

    "strength and endurance": [
        "Вам потрібно збільшити силу? (Так/Ні):\n",
        "Вам потрібно збільшити витривалість? (Так/Ні):\n"
    ]
}

answers = [
    """Нажаль я не можу допомогти вам.""",

    """
    Якщо вашою ціллю є збільшення м'язової маси, ви ведете активний спосіб життя та ви швидко набираєте вагу(ендоморф), 
    тоді найкращим планом тренувань будуть тренування з желізом(бодибілдинг) або з вагою власного тіла(калестеніка), 
    старайтеся тренувати кожну групу м'яз по 2 рази в тиждень, 
    старайтеся приймати 1-2 грами білків на кілограм маси тіла,
    вам також потрібно споживати середньо-збільшену добову норму калорій, яка розраховується за формулою: 
    Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 200. 
    Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 500.
    так як ви швидко набираєте вагу, но при тому ж ведете активний спосіб життя вам не потрібно включати в програму жироспалювальні тренування,
    Пам'ятайте: алкоголь, наркотики, неправильна дієта, стрес, недосип, частий пропуск тренувань... можуть сильно перешкоджувати вашому прогресу.""",

    """
    Якщо вашою ціллю є збільшення м'язової маси та ви швидко набираєте вагу(ендоморф), 
    тоді найкращим планом тренувань будуть тренування з желізом(бодибілдинг) або з вагою власного тіла(калестеніка), 
    старайтеся тренувати кожну групу м'яз по 2 рази в тиждень, 
    старайтеся приймати 1-2 грами білків на кілограм маси тіла,
    вам також потрібно споживати мало-збільшену добову норму калорій, яка розраховується за формулою: 
    Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках). 
    Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 200.
    так як ви швидко набираєте вагу, рекомендовано включити в програму жироспалювальні тренування,
    Пам'ятайте: алкоголь, наркотики, неправильна дієта, стрес, недосип, частий пропуск тренувань... можуть сильно перешкоджувати вашому прогресу.""",

    """
    Якщо вашою ціллю є збільшення м'язової маси, ви не швидко набираєте вагу(ектоморф/мезоморф) та ведете активний спосіб життя, 
    тоді найкращим планом тренувань будуть тренування з желізом(бодибілдинг) або з вагою власного тіла(калестеніка), 
    старайтеся тренувати кожну групу м'яз по 2 рази в тиждень, 
    старайтеся приймати 2 грами білків на кілограм маси тіла,
    вам також потрібно споживати сильно-збільшену добову норму калорій, яка розраховується за формулою: 
    Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 500. 
    Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 800.
    так як ви не швидко набираєте вагу і при тому ж ведете активний спосіб життя вам не потрібно включати в програму жироспалювальні тренування,
    Пам'ятайте: алкоголь, наркотики, неправильна дієта, стрес, недосип, частий пропуск тренувань... можуть сильно перешкоджувати вашому прогресу.""",

    """
    Якщо вашою ціллю є збільшення м'язової маси та ви не швидко набираєте вагу(ектоморф/мезоморф), 
    тоді найкращим планом тренувань будуть тренування з желізом(бодибілдинг) або з вагою власного тіла(калестеніка), 
    старайтеся тренувати кожну групу м'яз по 2 рази в тиждень, 
    старайтеся приймати 2 грами білків на кілограм маси тіла,
    вам також потрібно споживати середньо-збільшену добову норму калорій, яка розраховується за формулою: 
    Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 200. 
    Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 500.
    так як ви не швидко набираєте вагу, вам не потрібно включати в програму жироспалювальні тренування,
    Пам'ятайте: алкоголь, наркотики, неправильна дієта, стрес, недосип, частий пропуск тренувань... можуть сильно перешкоджувати вашому прогресу.""",

    """
    Якщо ваша ціль - скинути вагу, ви швидко набираєте вагу(ендоморф) та ведете активний спосіб життя,
    тоді необхідним планом тренувань будуть тренування на жироспалювання, любі види кардіо-тренувань
    якщо при цьому ви хочете зберегти якнайбільше м'язової маси або навіть наростити її(рекомпозиція) 
    необхідно буде включити в програму тренування з желізом або власною вагою, 
    також при похуданні необхідно приймати вилику кількість нутрієнтів, вітамінів і особливо білків, старайтеся приймати не менше 2 грам білків на кілограм маси
    вам також потрібно споживати збільшену або зменшену добову норму калорій залежно від вашої активності та типу тілобудови,
    якщо ви швидко набираєте вагу та ведете активний спосіб життя, ваша добова норма буде розраховуватись за такою формулою:
    Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) - 400. 
    Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) - 300.
    Пам'ятайте: алкоголь, наркотики, неправильна дієта, стрес, недосип, частий пропуск тренувань... можуть сильно перешкоджувати вашому прогресу.""",

    """
    Якщо ваша ціль - скинути вагу та ви швидко набираєте вагу(ендоморф),
    тоді необхідним планом тренувань будуть тренування на жироспалювання, любі види кардіо-тренувань
    якщо при цьому ви хочете зберегти якнайбільше м'язової маси або навіть наростити її(рекомпозиція) 
    необхідно буде включити в програму тренування з желізом або власною вагою, 
    також при похуданні необхідно приймати вилику кількість нутрієнтів, вітамінів і особливо білків, старайтеся приймати не менше 2 грам білків на кілограм маси
    вам також потрібно споживати збільшену або зменшену добову норму калорій залежно від вашої активності та типу тілобудови,
    якщо ви швидко набираєте вагу та не ведете активний спосіб життя, ваша добова норма буде розраховуватись за такою формулою:
    Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) - 600. 
    Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) - 450.
    Пам'ятайте: алкоголь, наркотики, неправильна дієта, стрес, недосип, частий пропуск тренувань... можуть сильно перешкоджувати вашому прогресу.""",

    """
    Якщо ваша ціль - скинути вагу та ви не швидко набираєте вагу(ектоморф/мезоморф),
    тоді рекомендованим планом тренувань будуть тренування на жироспалювання, любі види кардіо-тренувань
    якщо при цьому ви хочете зберегти якнайбільше м'язової маси або навіть наростити її(рекомпозиція) 
    необхідно буде включити в програму тренування з желізом або власною вагою, зауважте що похудання не займе у вас багато часу через вашу тілобудову
    також при похуданні необхідно приймати вилику кількість нутрієнтів, вітамінів і особливо білків, старайтеся приймати не менше 2 грам білків на кілограм маси
    вам також потрібно споживати збільшену або зменшену добову норму калорій залежно від вашої активності та типу тілобудови,
    якщо ви не швидко набираєте вагу та не ведете активний спосіб життя, ваша добова норма буде розраховуватись за такою формулою:
    Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) - 350. 
    Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) - 200.
    Пам'ятайте: алкоголь, наркотики, неправильна дієта, стрес, недосип, частий пропуск тренувань... можуть сильно перешкоджувати вашому прогресу.""",

    """Якщо ваша ціль - скинути вагу, ви не швидко набираєте вагу(ектоморф/мезоморф) та ведете активний спосіб життя,
    тоді рекомендованим планом тренувань будуть тренування на жироспалювання, любі види кардіо-тренувань
    якщо при цьому ви хочете зберегти якнайбільше м'язової маси або навіть наростити її(рекомпозиція) 
    необхідно буде включити в програму тренування з желізом або власною вагою, зауважте що похудання не займе у вас багато часу через вашу тілобудову та спосіб життя 
    також при похуданні необхідно приймати вилику кількість нутрієнтів, вітамінів і особливо білків, старайтеся приймати не менше 2 грам білків на кілограм маси
    вам також потрібно споживати збільшену або зменшену добову норму калорій залежно від вашої активності та типу тілобудови,
    якщо ви не швидко набираєте вагу та ведете активний спосіб життя, ваша добова норма буде розраховуватись за такою формулою:
    Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) - 250. 
    Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) - 100.
    Пам'ятайте: алкоголь, наркотики, неправильна дієта, стрес, недосип, частий пропуск тренувань... можуть сильно перешкоджувати вашому прогресу.""",

    """
    Якщо вашою ціллю є підтримання ваги вам потрібно споживати добову норму калорій,
    добова норма калорій розраховується в залежності від рівня активності, та тілобудови,
    розрахувати її можна за формулою: 
    Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) − 161. 
    Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 5.
    Зверніть увагу, якщо, зазвичай, на протязі дня у вас високий показник стресу, навіть найточніші формули добової норми калорій не допоможуть підтримати вашу вагу.
    Пам'ятайте: алкоголь, наркотики, неправильна дієта, стрес, недосип, частий пропуск тренувань... можуть сильно перешкоджувати вашому прогресу.""",

    """ 
    Якщо вашою ціллю є підтримання ваги вам потрібно споживати добову норму калорій,
    добова норма калорій розраховується в залежності від рівня активності, та тілобудови,
    розрахувати її можна за формулою:
    Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) − 161. 
    Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 5.
    Пам'ятайте: алкоголь, наркотики, неправильна дієта, стрес, недосип, частий пропуск тренувань... можуть сильно перешкоджувати вашому прогресу.""",

    """
    Якщо вашою ціллю є збільшення сили та витривалості, найкращим для покращення сили буде тренування з желізом,
    а для покращення витривалості любі тренування на витривалість(тренування з желізом[багатоповторка], біг, плавання, велосипед, футбол ...
    рекомендовано, що ви будете відділяти ці тренування між собою, але якщо такої можливості немає,
    найкращим буде тренування сили на початку та витривалості в кінці вашого тренування, 
    без профіциту калорій ви наврядчи спрогресуєте, тому потрібно споживати збільшену добову норму калорій, розрахувати таку норму можна за формулою:
    Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 500. 
    Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 800.
    Пам'ятайте: алкоголь, наркотики, неправильна дієта, стрес, недосип, частий пропуск тренувань... можуть сильно перешкоджувати вашому прогресу.""",

    """
    Якщо вашою ціллю є збільшення сили, важливим буде не стільки тренування як дієта, сон та інше...
    Тренувань в тиждень потрібно не багато(1-4 залежно від стажу) так як м'язам потрібно максимальне відновлення для росту показника сили
    найкращим буде тренування з желізом, ваги при цьому повинні бути великі(1-6 повторів за один підхід) адже ви покращуєте показник сили
    відпочинок між підходами та вправами також має бути великим 3-10хв, фокусуйтеся на базових вправах адже в більшості сила росте від них
    рекомендовано, щоб ви харчувались на профіциті калорій, розрахувати таку норму можна за формулою:
    Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 200. 
    Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 500.
    Хорошим доповненням буде використання креатину це хороша спортивна добавка для покращення сили, але це не обов'язково
    Пам'ятайте: алкоголь, наркотики, неправильна дієта, стрес, недосип, частий пропуск тренувань... можуть сильно перешкоджувати вашому прогресу.""",

    """
    Якщо вашою ціллю є збільшення витривалості найважливішою складовою прогресу будуть тренування
    Старайтеся тренуватись як найчастіше, найкраще підійдуть любі тренування на витривалість(тренування з желізом[багатоповторка], біг, плавання, велосипед, футбол ...
    Ваги при тренуванні з желізоб або час бігу/плавання... повинні бути великими, тільки так ви покращете свою витривалість
    рекомендовано, щоб ви харчувались на профіциті калорій, розрахувати таку норму можна за формулою:
    Для жінок: (10 × вага в кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 500. 
    Для чоловіків: (10 × вага у кілограмах) + (6,25 × зріст в сантиметрах) − (5 × вік у роках) + 800.
    Не забувайте про воду, при тренуваннях на витривалість дуже виснажують організм, тому велика кількість води - необхідна, так само як велика кількість якісного сну
    Пам'ятайте: алкоголь, наркотики, неправильна дієта, стрес, недосип, частий пропуск тренувань... можуть сильно перешкоджувати вашому прогресу."""
]


def main():
    result = 0

    for i in questions["general"]:
        q = input(i).lower()

        if q == "так":
            result = questions["general"].index(i) + 1
            break

    def gain_muscle():
        q1 = input(questions["gain muscle"][0]).lower()
        q2 = input(questions["gain muscle"][1]).lower()

        match q1, q2:
            case "так", "так":
                result = 1

            case "так", "ні":
                result = 2

            case "ні", "так":
                result = 3

            case "ні", "ні":
                result = 4

            case _:
                result = 0

        return result

    def lose_fat():
        q1 = input(questions["lose fat"][0]).lower()
        q2 = input(questions["lose fat"][1]).lower()

        match q1, q2:
            case "так", "так":
                result = 5

            case "так", "ні":
                result = 6

            case "ні", "так":
                result = 7

            case "ні", "ні":
                result = 8

            case _:
                result = 0

        return result

    def maintain_weight():
        q1 = input(questions["maintain weight"][0]).lower()

        match q1:
            case "так":
                result = 9

            case "ні":
                result = 10

            case _:
                result = 0

        return result

    def strength_and_endurance():
        q1 = input(questions["strength and endurance"][0]).lower()
        q2 = input(questions["strength and endurance"][1]).lower()

        match q1, q2:
            case "так", "так":
                result = 11

            case "так", "ні":
                result = 12

            case "ні", "так":
                result = 13

            case _:
                result = 0

        return result

    match result:
        case 1:
            result = gain_muscle()

        case 2:
            result = lose_fat()

        case 3:
            result = maintain_weight()

        case 4:
            result = strength_and_endurance()

    return answers[result]


if __name__ == "__main__":
    print(main())
